Tsar/smart_home/ESP8266_Firmware/src/main.cpp
// Same as WiFi.disconnect(true), but without touching config
void disconnectWiFi() {
    if (WiFi.getMode() & WIFI_STA) {
      wifi_station_disconnect();
    }
    WiFi.enableSTA(false);
}

void rejoinMulticastGroup() {
  const auto& ip = WiFi.localIP();
  Serial.printf("IGMP leave group %s\n", igmp_leavegroup(ip, UDP_MULTICAST_IP) == ERR_OK ? "OK" : "failed");
  Serial.printf("IGMP join group %s\n", igmp_joingroup(ip, UDP_MULTICAST_IP) == ERR_OK ? "OK" : "failed");
}

void enableAccessPoint() {
  if (isAccessPointEnabled) return;

  uint8_t mac[WL_MAC_ADDR_LENGTH];
  WiFi.macAddress(mac);
  char softAPName[32] = {};
  sprintf(softAPName, "SmartHomeDevice_%02X%02X%02X", mac[3], mac[4], mac[5]);

  Serial.printf("Enabling access point '%s' ... ", softAPName);
  const bool result = WiFi.softAP(softAPName, "setup12345");
  if (!result) {
    Serial.println("Failed");
    fastBlinkForever();
    return;
  }

  const String ip = WiFi.softAPIP().toString();
  Serial.printf("Access point enabled, IP: %s\n", ip.c_str());
  digitalWrite(LED_BUILTIN, LOW);
  isAccessPointEnabled = true;
}

bool connectToWiFi(const char* ssid, const char* passphrase, bool connectInfinitely) {
  digitalWrite(LED_BUILTIN, LOW);
  udp.stop();

  Serial.printf("Connecting to wi-fi: SSID '%s', passphrase '%s'\n", ssid, passphrase);
  WiFi.begin(ssid, passphrase);

  wifiConnectResult = WiFi.waitForConnectResult(30000);
  while (wifiConnectResult != WL_CONNECTED) {
    if (!connectInfinitely) {
      Serial.printf("Failed to connect, status: %d\n", wifiConnectResult);
      return false;
    }
    Serial.printf("Not yet connected, status: %d\n", wifiConnectResult);
    delay(1000);  // making delay for part of wait, because sometimes waitForConnectResult exits immediately
    wifiConnectResult = WiFi.waitForConnectResult(9000);
  }

  const auto& ip = WiFi.localIP();
  Serial.printf("Connected, IP: %s\n", ip.toString().c_str());
  digitalWrite(LED_BUILTIN, HIGH);

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  experimental::ESP8266WiFiGratuitous::stationKeepAliveSetIntervalMs();

  const bool listeningMulticast = udp.beginMulticast(ip, UDP_MULTICAST_IP, UDP_MULTICAST_PORT);
  if (listeningMulticast) {
    Serial.printf("Started listening UDP multicast on %s:%d\n", UDP_MULTICAST_IP.toString().c_str(), UDP_MULTICAST_PORT);
    rejoinMulticastGroupTicker.detach();
    rejoinMulticastGroupTicker.attach_ms_scheduled(REJOIN_MULTICAST_GROUP_INTERVAL, rejoinMulticastGroup);
  } else {
    Serial.println("Failed to start listening UDP multicast");
  }

  return true;
}

bool checkPassword() {
  if (server.hasHeader("Password") && server.header("Password") == homeCfg.getPassword()) {
    return true;
  }
  server.send(403, "text/plain", "Forbidden");
  Serial.printf("Sent 403 for %s\n", server.uri().c_str());
  return false;
}

void sendBadRequest() {
  server.send(400, "text/plain", "Bad Request");
  Serial.printf("Sent 400 for %s\n", server.uri().c_str());
}

// Create JSON (inefficient function, only for manual debugging)
String generateInfoJson(bool minimal) {
  String result = "{\n  \"mac\": \"" + WiFi.macAddress()
              + "\",\n  \"name\": \"" + homeCfg.getName()
              + "\",\n  \"firmware_version\": " + String(FIRMWARE_VERSION);
  if (!minimal) {
    result += ",\n  \"values\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": " + String(homeCfg.getDimmerValue(i)) + ",\n    \"";
    }
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.getSwitcherValue(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"micros\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      const uint16_t value = homeCfg.getDimmerValue(i);
      result += DIMMER_PREFIX + String(i) + "\": " + String(value > 0 ? dimmerValueToMicros(value, i) : -1) + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"dimmers_settings\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": {\n      \"value_change_step\": " + String(dimmersSettings[i].valueChangeStep)
                                              + ",\n      \"min_lightness_micros\": " + String(dimmersSettings[i].minLightnessMicros)
                                              + ",\n      \"max_lightness_micros\": " + String(dimmersSettings[i].maxLightnessMicros)
                                              + "\n    }" + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"dimmer_value_after_boot\": " + String(homeCfg.getDimmerValueAfterBoot()) + ",\n  \"switchers_inverted\": {\n    \"";
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.isSwitcherInverted(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"switcher_value_after_boot\": " + String(homeCfg.getSwitcherValueAfterBoot()) + ",\n  \"additional_blob\": \"";
    const String& additionalBlob = homeCfg.getAdditionalBlob();
    for (unsigned int i = 0; i < additionalBlob.length(); ++i) {
      result += String(additionalBlob[i], 16) + (i + 1 == additionalBlob.length() ? "" : " ");
    }
    const auto currentUptime = millis();
    result += "\",\n  \"uptime_ms\": " + String(currentUptime)
            + ",\n  \"input_falls_count\": " + String(inputFallsCount)
            + ",\n  \"average_input_fall_interval_ms\": " + String(static_cast<double>(currentUptime) / inputFallsCount, 5);
  }
  result += "\n}\n";
  return result;
}

class UnalignedBinarySerializer {
public:
  UnalignedBinarySerializer(char* buffer) : buffer_(buffer), pos_(0) {}

  void writeWiFiMacAddress() {
    WiFi.macAddress(reinterpret_cast<uint8_t*>(buffer_ + pos_));
    pos_ += WL_MAC_ADDR_LENGTH;
  }

  void writeUInt8(uint8_t value) {
    buffer_[pos_++] = value;
  }

  void writeUInt16(uint16_t value) {
    memcpy(buffer_ + pos_, &value, 2);
    pos_ += 2;
  }

  void writeString(String value) {
    writeUInt16(value.length());
    memcpy(buffer_ + pos_, value.c_str(), value.length());
    pos_ += value.length();
  }

  size_t getWrittenSize() const {
    return pos_;
  }

