Tsar/smart_home/ESP8266_Firmware/src/main.cpp
    accepted = true;
  } else {
    server.send(200, "text/plain", "NOTHING_CHANGED\n");
  }

  const auto tsEnd = micros64();
  Serial.printf(
    "Handled %s, spent %.2lf ms, %s\n",
    server.uri().c_str(),
    (tsEnd - tsStart) / 1000.0,
    accepted ? "accepted new values" : "nothing was changed"
  );
}

void handleSetSettings() {
  if (!checkPassword()) return;

  if (server.hasArg("name")) {
    homeCfg.setName(server.arg("name"));
  }

  bool resetCfgHappened;
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    const String argName = DIMMER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const String settingsStr = server.arg(argName);
      const int comma1Pos = settingsStr.indexOf(",");
      if (comma1Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      const int comma2Pos = settingsStr.indexOf(",", comma1Pos + 1);
      if (comma2Pos < 0) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      smart_home::DimmerSettings settings;
      settings.valueChangeStep = settingsStr.substring(0, comma1Pos).toInt();
      settings.minLightnessMicros = settingsStr.substring(comma1Pos + 1, comma2Pos).toInt();
      settings.maxLightnessMicros = settingsStr.substring(comma2Pos + 1).toInt();
      if (!settings.areValid()) {
        homeCfg.loadOrReset(resetCfgHappened);  // used to revert cfg
        sendBadRequest();
        return;
      }
      homeCfg.setDimmerSettings(i, settings);
    }
  }

  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    const String argName = SWITCHER_PREFIX + String(i);
    if (server.hasArg(argName)) {
      const bool inverted = server.arg(argName).toInt();
      if (homeCfg.isSwitcherInverted(i) != inverted) {
        homeCfg.setSwitcherInverted(i, inverted);
        homeCfg.setSwitcherValue(i, !homeCfg.getSwitcherValue(i));
      }
    }
  }

  if (server.hasArg("dvab")) {
    homeCfg.setDimmerValueAfterBoot(server.arg("dvab").toInt());
  }
  if (server.hasArg("svab")) {
    homeCfg.setSwitcherValueAfterBoot(server.arg("svab").toInt());
  }

  if (server.hasArg("blob")) {
    homeCfg.setAdditionalBlob(server.arg("blob"));
  }

  homeCfg.save();
  server.send(200, "text/plain", "ACCEPTED\n");
  Serial.printf("Handled %s\n", server.uri().c_str());
}

void handleSetPassword() {
  if (!checkPassword()) return;

  if (!server.hasArg("password")) {
    sendBadRequest();
    return;
  }

  homeCfg.setPassword(server.arg("password"));
  homeCfg.save();
  updateServer.updateCredentials(UPDATER_USERNAME, homeCfg.getPassword());

  server.send(200, "text/plain", "ACCEPTED\n");
  Serial.printf("Handled %s\n", server.uri().c_str());
}

void handleNotFound() {
  server.send(404, "text/plain", "Not Found");
  Serial.printf("Sent 404 for %s\n", server.uri().c_str());
}

void udpHandlePacket() {
  int packetSize = udp.parsePacket();
  if (packetSize == static_cast<int>(UDP_SCAN_REQUEST.length())) {
    int len = udp.read(udpInputBuffer, packetSize);
    udpInputBuffer[len] = 0;
    if (UDP_SCAN_REQUEST == String(udpInputBuffer)) {
      const String response = "MAC=" + WiFi.macAddress() + "\nNAME=" + homeCfg.getName();
      udp.beginPacket(udp.remoteIP(), UDP_RESPONSE_PORT);  // unicast back
      udp.write(response.c_str());
      udp.endPacket();
      Serial.printf("Handled UDP scan request #%d\n", ++udpScanCounter);
    }
  }
}

void resetWiFiResetSequence() {
  homeCfg.setWiFiResetSequenceLengthAndSave(0);
  Serial.printf("Done reset wi-fi reset sequence length to zero; current uptime = %ld ms\n", millis());
}

void incrementWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  homeCfg.setWiFiResetSequenceLengthAndSave(currentSeqLength + 1);

  const auto currentUptime = millis();
  Serial.printf("Done wi-fi reset sequence length incrementation to %d; current uptime = %ld ms\n", currentSeqLength + 1, currentUptime);

  const uint32_t resetSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 1.2;
  if (resetSeqLengthUptime >= currentUptime) {
    wifiResetSequenceDetectorTicker.once_ms(resetSeqLengthUptime - currentUptime, resetWiFiResetSequence);
  } else {
    resetWiFiResetSequence();
  }
}

// Проверка и обработка кодовой последовательности продолжительности включений контроллера для сброса настроек wi-fi
void checkWiFiResetSequence() {
  const uint8_t currentSeqLength = homeCfg.getWiFiResetSequenceLength();
  if (currentSeqLength >= WIFI_RESET_SEQUENCE.size()) {
    homeCfg.setPassword(DEFAULT_HTTP_PASSWORD);  // пароль для HTTP тоже сбрасываем, чтобы можно было добавить устройство как свежее
    homeCfg.setWiFiResetSequenceLengthAndSave(0);

    Serial.println("Reset wi-fi credentials by code sequence of uptimes");
    WiFi.disconnect(true);

    // Поморгать встроенным светодиодом 5 раз
    for (uint8_t i = 0; i < 5; ++i) {
      digitalWrite(LED_BUILTIN, HIGH);
      delay(60);
      digitalWrite(LED_BUILTIN, LOW);
      delay(60);
    }
  } else {
    const auto currentUptime = millis();
    const uint32_t incrementSeqLengthUptime = WIFI_RESET_SEQUENCE[currentSeqLength] * 0.8;
    if (incrementSeqLengthUptime >= currentUptime) {
      const uint32_t interval = incrementSeqLengthUptime - currentUptime;
      wifiResetSequenceDetectorTicker.once_ms(interval, incrementWiFiResetSequence);
    } else {
      Serial.println("Failed to schedule wi-fi reset sequence length incrementation: it should have been in the past");
    }
  }
}

void setup() {
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    pinMode(DIMMER_PINS[i], OUTPUT);
    digitalWrite(DIMMER_PINS[i], LOW);
  }
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    pinMode(SWITCHER_PINS[i], OUTPUT);
  }

  bool resetCfgHappened;
  homeCfg.loadOrReset(resetCfgHappened);

  initCfgDimmerValuesAfterBoot();
  initCfgSwitcherValuesAfterBoot();

  dimmersSettings = homeCfg.getDimmersSettings();
  fillDimmerValues();
  createEventsQueue();
  applySwitcherValues();

  timer1_attachInterrupt(onTimerISR);
  timer1_enable(TIM_DIV16, TIM_EDGE, TIM_SINGLE);

  pinMode(INPUT_PIN, INPUT);
  attachInterrupt(digitalPinToInterrupt(INPUT_PIN), onInputFall, FALLING);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);

