Tsar/smart_home/ESP8266_Firmware/src/main.cpp
  Serial.begin(115200);
  Serial.printf("\n%s\nDevice name: %s, firmware version: %d, HTTP password: '%s'\n",
                resetCfgHappened ? "CONFIGURATION RESET HAPPENED!" : "Configuration loaded successfully",
                homeCfg.getName().c_str(), FIRMWARE_VERSION, homeCfg.getPassword().c_str()
  );

  checkWiFiResetSequence();

  WiFi.persistent(true);
  WiFi.setAutoConnect(false);
  WiFi.setAutoReconnect(true);

  // Не используем WiFi.disconnect и WiFi.softAPdisconnect, чтобы не трогать сохранённые настройки, а то reset в неподходящий момент всё портит
  disconnectWiFi();
  WiFi.enableAP(false);
  isAccessPointEnabled = false;

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  if (!WiFi.setSleepMode(WIFI_NONE_SLEEP)) {
    Serial.println("Failed to set wi-fi sleep mode to None!");
  }

  station_config stationCfg;
  wifi_station_get_config_default(&stationCfg);
  const char* cfgSsid = reinterpret_cast<char*>(stationCfg.ssid);
  const char* cfgPassphrase = reinterpret_cast<char*>(stationCfg.password);

  if (strlen(cfgSsid) > 0) {
    Serial.println("Found wi-fi credentials");
    connectToWiFi(cfgSsid, cfgPassphrase, true);
  } else {
    Serial.println("No wi-fi credentials found");
    enableAccessPoint();
  }

  server.on("/get_info", HTTP_GET, handleGetInfo);
  server.on("/setup_wifi", HTTP_POST, handleSetupWiFi);
  server.on("/get_setup_wifi_state", HTTP_GET, handleGetSetupWiFiState);
  server.on("/reset_wifi", HTTP_GET, handleResetWiFi);
  server.on("/turn_off_ap", HTTP_GET, handleTurnOffAccessPoint);
  server.on("/set_values", HTTP_ANY, handleSetValues);
  server.on("/set_settings", HTTP_POST, handleSetSettings);
  server.on("/set_password", HTTP_POST, handleSetPassword);
  server.onNotFound(handleNotFound);

  const char* headerKeys[] = {"Password"};
  server.collectHeaders(headerKeys, 1);

  updateServer.setup(&server, "/fw_update", UPDATER_USERNAME, homeCfg.getPassword());

  server.begin();
  Serial.printf("Started HTTP server on port %d\n", HTTP_SERVER_PORT);
}

void loop() {
  server.handleClient();
  udpHandlePacket();
}
